import './LegalPages.css';

export default function TermsPage() {
  return (
    <div className="legal-container">
      <h1>Пользовательское Соглашение</h1>
      <p>Настоящее Пользовательское Соглашение (далее Соглашение) регулирует отношения между владельцем (далее GameHub или Администрация) с одной стороны и пользователем сайта с другой.</p>
      <p>Сайт GameHub не является средством массовой информации.</p>
      <p className='bold'>Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы не согласны с условиями — не используйте сайт GameHub!</p>

      <h2>Предмет соглашения</h2>
      <p className='bold'>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</p>
      <ul>
        <li>Текстовой информации</li>
      </ul>

      <h2>Права и обязанности сторон</h2>
      <h3>Пользователь имеет право:</h3>
      <ul>
        <li>Осуществлять поиск информации на сайте</li>
        <li>Получать информацию на сайте</li>
        <li>Использовать информацию сайта в личных некоммерческих целях</li>
      </ul>

      <h3>Администрация имеет право:</h3>
      <ul>
        <li>Создавать, изменять, отменять правила</li>
        <li>Ограничивать доступ к любой информации на сайте</li>
        <li>Создавать, изменять, удалять информацию</li>
        <li>Удалять учетные записи</li>
        <li>Отказывать в регистрации без объяснения причин</li>
      </ul>

      <h3>Пользователь обязуется:</h3>
      <ul>
        <li>Не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность
- не нарушать работоспособность сайта
</li>
        <li>Не нарушать работоспособность сайта</li>
        <li>Не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
        <li>Не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
      </ul>

      <h3>Администрация обязуется:</h3>
      <ul>
        <li>Поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
        <li>Осуществлять разностороннюю защиту учетной записи Пользователя</li>
        <li>Защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</li>
        <li>Предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</li>
      </ul>

      <h2>Ответственность сторон</h2>
      <ul>
        <li>Администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</li>
        <li>Администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</li>
        <li>В случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
      </ul>

      <h2>Условия действия Соглашения</h2>
      <p>Данное Соглашение вступает в силу при регистрации на сайте.
        Соглашение перестает действовать при появлении его новой версии.
        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
        Администрация не оповещает пользователей об изменении в Соглашении.
        </p>
    </div>
  );
}
